#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westus"
      + max_bid_price                   = -1
      + name                            = "jump-box1"
      + network_interface_ids           = (known after apply)
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "k8sauto-aks-jump"
      + size                            = "Standard_B1ls"
      + tags                            = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDB4NUqYv7jiaVWJWTynDm5mOc71XEPx6eMX/3m+eDm/pglpe35QmSuhxjw/sQMSRiEIF/Pm3Ycf449XkPnFn2jUHimXnFrldMF6OGZyK0L/cZmd6PZ0ZvQjByTDqQaULg0BOfYS4LGX2d0LBetPnTpRB/dSqgNb+KC755tUY/UWDf7+AMP4Xg/PEDLIE2yjgbh6jGT0Kd4jdUr2ajtxAlg7j1AR5+B5GkdrcdEvzaF2mMd6iUNPYYJ1m7zoUOLocE06jgLs9FXPEszcyHeMTyCeoz7gedn78FGHb2QfpMHieFfng+VVD1ET4zAHigkwzpCqkcRbWWA3jrs1cORKtzVJL0e2iA65IDrU7VUyHG6px0c2HOaLd/kJTXHdSx7sqxQoj0QUWeUt4pXnGJb+FFBjBZIDkWwzMGqqhGn2KJzdx2TvlkxiSmfG9Aozl3WV9JFD75lBW6QS1/rAEJjnXR8K0oNZvclLCUVMhOpeqaoOrLNMsQyT6zo8agHBc+ceGQ9jP5AQjvfv4c01j0o8gCjHvoiR8ftSLzc5xwmuhowrURThVGCrHwl1WgZk1PWgLr/MhI8OXhrwqKSOHLOWCa9brozSOA3lFl7oG8Lu5ur66wmT/Ke5kEy+uRXAMNpMEfmIxUMuY0r4zskbanx4HXzhAkz5pHmI3bNqQ0ngdRLNw==
            EOT
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.vm will be created
  + resource "azurerm_network_interface" "vm" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westus"
      + mac_address                   = (known after apply)
      + name                          = "internal"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "k8sauto-aks-jump"
      + tags                          = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = "internal"
          + primary                       = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/k8sauto-core/providers/Microsoft.Network/virtualNetworks/aksnet/subnets/akscontrolsub"
        }
    }

  # azurerm_network_interface_security_group_association.vm_ssh will be created
  + resource "azurerm_network_interface_security_group_association" "vm_ssh" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # azurerm_network_security_group.jump_box will be created
  + resource "azurerm_network_security_group" "jump_box" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "nsg-jumpbox-ssh"
      + resource_group_name = "k8sauto-aks-jump"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
    }

  # azurerm_public_ip.vm will be created
  + resource "azurerm_public_ip" "vm" {
      + allocation_method       = "Static"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus"
      + name                    = "jump-box-pip"
      + resource_group_name     = "k8sauto-aks-jump"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.aks_jump will be created
  + resource "azurerm_resource_group" "aks_jump" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "k8sauto-aks-jump"
      + tags     = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
    }

  # local_file.ansible_inventory will be created
  + resource "local_file" "ansible_inventory" {
      + content              = (sensitive)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./ansible/inventory.yml"
      + id                   = (known after apply)
    }

  # local_file.rsa_key will be created
  + resource "local_file" "rsa_key" {
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./ansible/rsa.key"
      + id                   = (known after apply)
      + sensitive_content    = (sensitive value)
    }

  # null_resource.ansible will be created
  + resource "null_resource" "ansible" {
      + id = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ansible_inventory = (sensitive value)
  + jump_box_ip       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*